package io.yagus.exchangeratecalculator.Model;

import java.util.ArrayList;

/**
 *






 var exView = {
 "날짜": "2019년 05월 29일 16:31",
 "리스트":
 [

 {
 "통화명": "미국 USD",
 "현찰사실때":"1215.40",
 "현찰파실때":"1173.60",
 "송금_전신환보내실때":"1206.20",
 "송금_전신환받으실때":"1182.80",
 "매매기준율":"1194.50"
 },

 {
 "통화명": "일본 JPY 100",
 "현찰사실때":"1112.34",
 "현찰파실때":"1074.08",
 "송금_전신환보내실때":"1103.92",
 "송금_전신환받으실때":"1082.50",
 "매매기준율":"1093.21"
 },

 {
 "통화명": "유로 EUR",
 "현찰사실때":"1359.40",
 "현찰파실때":"1306.36",
 "송금_전신환보내실때":"1346.20",
 "송금_전신환받으실때":"1319.56",
 "매매기준율":"1332.88"
 },

 {
 "통화명": "중국 CNY",
 "현찰사실때":"180.93",
 "현찰파실때":"163.71",
 "송금_전신환보내실때":"174.04",
 "송금_전신환받으실때":"170.60",
 "매매기준율":"172.32"
 },

 {
 "통화명": "홍콩 HKD",
 "현찰사실때":"155.17",
 "현찰파실때":"149.19",
 "송금_전신환보내실때":"153.70",
 "송금_전신환받으실때":"150.66",
 "매매기준율":"152.18"
 },

 {
 "통화명": "태국 THB",
 "현찰사실때":"39.39",
 "현찰파실때":"35.27",
 "송금_전신환보내실때":"37.89",
 "송금_전신환받으실때":"37.15",
 "매매기준율":"37.52"
 },

 {
 "통화명": "대만 TWD",
 "현찰사실때":"42.72",
 "현찰파실때":"35.14",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"37.78"
 },

 {
 "통화명": "필리핀 PHP",
 "현찰사실때":"25.06",
 "현찰파실때":"20.93",
 "송금_전신환보내실때":"23.01",
 "송금_전신환받으실때":"22.57",
 "매매기준율":"22.79"
 },

 {
 "통화명": "싱가포르 SGD",
 "현찰사실때":"881.20",
 "현찰파실때":"846.82",
 "송금_전신환보내실때":"872.65",
 "송금_전신환받으실때":"855.37",
 "매매기준율":"864.01"
 },

 {
 "통화명": "호주 AUD",
 "현찰사실때":"842.51",
 "현찰파실때":"809.97",
 "송금_전신환보내실때":"834.50",
 "송금_전신환받으실때":"817.98",
 "매매기준율":"826.24"
 },

 {
 "통화명": "베트남 VND 100",
 "현찰사실때":"5.70",
 "현찰파실때":"4.50",
 "송금_전신환보내실때":"5.15",
 "송금_전신환받으실때":"5.05",
 "매매기준율":"5.10"
 },

 {
 "통화명": "영국 GBP",
 "현찰사실때":"1541.23",
 "현찰파실때":"1481.69",
 "송금_전신환보내실때":"1526.57",
 "송금_전신환받으실때":"1496.35",
 "매매기준율":"1511.46"
 },

 {
 "통화명": "캐나다 CAD",
 "현찰사실때":"901.91",
 "현찰파실때":"867.07",
 "송금_전신환보내실때":"893.33",
 "송금_전신환받으실때":"875.65",
 "매매기준율":"884.49"
 },

 {
 "통화명": "말레이시아 MYR",
 "현찰사실때":"302.43",
 "현찰파실때":"263.46",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"281.67",
 "매매기준율":"284.51"
 },

 {
 "통화명": "러시아 RUB",
 "현찰사실때":"19.69",
 "현찰파실때":"16.39",
 "송금_전신환보내실때":"18.59",
 "송금_전신환받으실때":"18.23",
 "매매기준율":"18.41"
 },

 {
 "통화명": "남아공화국 ZAR",
 "현찰사실때":"85.25",
 "현찰파실때":"74.00",
 "송금_전신환보내실때":"81.39",
 "송금_전신환받으실때":"79.47",
 "매매기준율":"80.43"
 },

 {
 "통화명": "노르웨이 NOK",
 "현찰사실때":"140.20",
 "현찰파실때":"133.50",
 "송금_전신환보내실때":"138.21",
 "송금_전신환받으실때":"135.49",
 "매매기준율":"136.85"
 },

 {
 "통화명": "뉴질랜드 NZD",
 "현찰사실때":"795.25",
 "현찰파실때":"764.53",
 "송금_전신환보내실때":"787.68",
 "송금_전신환받으실때":"772.10",
 "매매기준율":"779.89"
 },

 {
 "통화명": "덴마크 DKK",
 "현찰사실때":"182.87",
 "현찰파실때":"174.13",
 "송금_전신환보내실때":"180.28",
 "송금_전신환받으실때":"176.72",
 "매매기준율":"178.50"
 },

 {
 "통화명": "멕시코 MXN",
 "현찰사실때":"68.29",
 "현찰파실때":"56.88",
 "송금_전신환보내실때":"62.71",
 "송금_전신환받으실때":"61.47",
 "매매기준율":"62.09"
 },

 {
 "통화명": "몽골 MNT",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"0.45"
 },

 {
 "통화명": "바레인 BHD",
 "현찰사실때":"3371.22",
 "현찰파실때":"2914.97",
 "송금_전신환보내실때":"3200.12",
 "송금_전신환받으실때":"3136.76",
 "매매기준율":"3168.44"
 },

 {
 "통화명": "방글라데시 BDT",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"14.14"
 },

 {
 "통화명": "브라질 BRL",
 "현찰사실때":"327.05",
 "현찰파실때":"273.04",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"293.22",
 "매매기준율":"296.78"
 },

 {
 "통화명": "브루나이 BND",
 "현찰사실때":"898.57",
 "현찰파실때":"812.17",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"864.01"
 },

 {
 "통화명": "사우디아라비아 SAR",
 "현찰사실때":"338.57",
 "현찰파실때":"296.54",
 "송금_전신환보내실때":"321.69",
 "송금_전신환받으실때":"315.33",
 "매매기준율":"318.51"
 },

 {
 "통화명": "스리랑카 LKR",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"6.78"
 },

 {
 "통화명": "스웨덴 SEK",
 "현찰사실때":"127.74",
 "현찰파실때":"121.64",
 "송금_전신환보내실때":"125.93",
 "송금_전신환받으실때":"123.45",
 "매매기준율":"124.69"
 },

 {
 "통화명": "스위스 CHF",
 "현찰사실때":"1210.71",
 "현찰파실때":"1163.93",
 "송금_전신환보내실때":"1199.19",
 "송금_전신환받으실때":"1175.45",
 "매매기준율":"1187.32"
 },

 {
 "통화명": "아랍에미리트공화국 AED",
 "현찰사실때":"343.09",
 "현찰파실때":"302.78",
 "송금_전신환보내실때":"328.46",
 "송금_전신환받으실때":"321.96",
 "매매기준율":"325.21"
 },

 {
 "통화명": "알제리 DZD",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"9.99"
 },

 {
 "통화명": "오만 OMR",
 "현찰사실때":"3378.47",
 "현찰파실때":"2916.22",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"3102.36"
 },

 {
 "통화명": "요르단 JOD",
 "현찰사실때":"1834.71",
 "현찰파실때":"1549.99",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"1684.77"
 },

 {
 "통화명": "이스라엘 ILS",
 "현찰사실때":"363.49",
 "현찰파실때":"304.02",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"330.45"
 },

 {
 "통화명": "이집트 EGP",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"71.06"
 },

 {
 "통화명": "인도 INR",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"17.09"
 },

 {
 "통화명": "인도네시아 IDR 100",
 "현찰사실때":"8.88",
 "현찰파실때":"7.47",
 "송금_전신환보내실때":"8.38",
 "송금_전신환받으실때":"8.22",
 "매매기준율":"8.30"
 },

 {
 "통화명": "체코 CZK",
 "현찰사실때":"55.92",
 "현찰파실때":"46.91",
 "송금_전신환보내실때":"52.10",
 "송금_전신환받으실때":"50.98",
 "매매기준율":"51.54"
 },

 {
 "통화명": "칠레 CLP",
 "현찰사실때":"1.82",
 "현찰파실때":"1.56",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"1.69"
 },

 {
 "통화명": "카자흐스탄 KZT",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"3.13"
 },

 {
 "통화명": "카타르 QAR",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"328.00"
 },

 {
 "통화명": "케냐 KES",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"11.79"
 },

 {
 "통화명": "콜롬비아 COP",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"0.35"
 },

 {
 "통화명": "쿠웨이트 KWD",
 "현찰사실때":"4179.73",
 "현찰파실때":"3610.66",
 "송금_전신환보내실때":"3963.87",
 "송금_전신환받으실때":"3885.39",
 "매매기준율":"3924.63"
 },

 {
 "통화명": "탄자니아 TZS",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"0.52"
 },

 {
 "통화명": "터키 TRY",
 "현찰사실때":"227.43",
 "현찰파실때":"178.24",
 "송금_전신환보내실때":"199.77",
 "송금_전신환받으실때":"195.43",
 "매매기준율":"197.60"
 },

 {
 "통화명": "파키스탄 PKR",
 "현찰사실때":"0.00",
 "현찰파실때":"0.00",
 "송금_전신환보내실때":"0.00",
 "송금_전신환받으실때":"0.00",
 "매매기준율":"7.91"
 },

 {
 "통화명": "폴란드 PLN",
 "현찰사실때":"334.70",
 "현찰파실때":"285.12",
 "송금_전신환보내실때":"313.31",
 "송금_전신환받으실때":"306.51",
 "매매기준율":"309.91"
 },

 {
 "통화명": "헝가리 HUF",
 "현찰사실때":"4.44",
 "현찰파실때":"3.75",
 "송금_전신환보내실때":"4.11",
 "송금_전신환받으실때":"4.03",
 "매매기준율":"4.07"
 },

 ]
 }
 */
public class Model_Exchange {
    String 날짜;
    ArrayList<TransModel> 리스트;

    public String get날짜() {
        return 날짜;
    }

    public void set날짜(String 날짜) {
        this.날짜 = 날짜;
    }

    public ArrayList<TransModel> get리스트() {
        return 리스트;
    }

    public void set리스트(ArrayList<TransModel> 리스트) {
        this.리스트 = 리스트;
    }

    /**
     * "통화명": "미국 USD",
     *  "현찰사실때":"1215.40",
     *  "현찰파실때":"1173.60",
     *  "송금_전신환보내실때":"1206.20",
     *  "송금_전신환받으실때":"1182.80",
     *  "매매기준율":"1194.50"
     */
    public class TransModel
    {
        String 통화명;
        String 현찰사실때;
        String 현찰파실때;
        String 송금_전신환보내실때;
        String 송금_전신환받으실때;
        String 매매기준율;

        public String get통화명() {
            return 통화명;
        }

        public void set통화명(String 통화명) {
            this.통화명 = 통화명;
        }

        public String get현찰사실때() {
            return 현찰사실때;
        }

        public void set현찰사실때(String 현찰사실때) {
            this.현찰사실때 = 현찰사실때;
        }

        public String get현찰파실때() {
            return 현찰파실때;
        }

        public void set현찰파실때(String 현찰파실때) {
            this.현찰파실때 = 현찰파실때;
        }

        public String get송금_전신환보내실때() {
            return 송금_전신환보내실때;
        }

        public void set송금_전신환보내실때(String 송금_전신환보내실때) {
            this.송금_전신환보내실때 = 송금_전신환보내실때;
        }

        public String get송금_전신환받으실때() {
            return 송금_전신환받으실때;
        }

        public void set송금_전신환받으실때(String 송금_전신환받으실때) {
            this.송금_전신환받으실때 = 송금_전신환받으실때;
        }

        public String get매매기준율() {
            return 매매기준율;
        }

        public void set매매기준율(String 매매기준율) {
            this.매매기준율 = 매매기준율;
        }

        public Model_Exchange_trans toMET(){
            Model_Exchange_trans model_exchange_trans = new Model_Exchange_trans();
            model_exchange_trans.setBuyCash(get현찰사실때());
            model_exchange_trans.setCurrencyName(get통화명());
            model_exchange_trans.setSellCash(get현찰파실때());
            model_exchange_trans.setTradingStandardRate(get매매기준율());
            //TODO::
            return model_exchange_trans;
        }
    }



}
